## 연습문제

### 1

In [25]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [29]:
nba.dtypes.value_counts() # 자료형별로 몇개씩 있는지

object            3
datetime64[ns]    1
int64             1
dtype: int64

### 2

In [31]:
nba.ndim

2

In [35]:
nba.shape

(450, 5)

In [37]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [41]:
nba.index

RangeIndex(start=0, stop=450, step=1)

### 3

In [143]:
len(nba) - nba.count() # 결측치 개수
nba.count().sum(axis=0)# 전체개수

2250

### 4

In [145]:
nba.nunique(axis=0)

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [53]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [54]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

### 5

In [84]:
nba.nlargest(5,columns=['Salary'])

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

### 6

In [71]:
nba.nlargest(5,columns=['Birthday'])

                    Name                  Team Position   Birthday   Salary
136      Sekou Doumbouya       Detroit Pistons       SF 2000-12-23  3285120
432  Talen Horton-Tucker    Los Angeles Lakers       GF 2000-11-25   898310
137      Zion Williamson  New Orleans Pelicans        F 2000-07-06  9757440
313           RJ Barrett       New York Knicks       SG 2000-06-14  7839960
392         Jalen Lecque          Phoenix Suns        G 2000-06-13   898310

### 7

In [82]:
nba[['Salary']].sum()
nba[['Salary']].mean()
nba[['Salary']].median()
nba[['Salary']].std()

Salary    9.288810e+06
dtype: float64

### 연습문제

In [127]:
round(titanic['age'].mean(),2) #1

29.7

In [137]:
round(titanic[titanic['sex']=='female']['age'].mean(),1) # 2
# 여자의 평균 나이

27.9

In [142]:
round(titanic[(titanic['pclass']==1) & (titanic['sex']=='female')]['age'].mean(),1) # 3
# pclass가 1이면서 여자승객의 평균 나이

34.6